Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་གྱི་ཁམས་དེའི་དབུས་སུ། གླིང་བཞི་པ་བདེ་བ་ཡོད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: In the center of that world realm there was a four-continent world called Kṣemāvatī.

source: གླིང་བཞི་པ་དེའི་འཛམ་བུའི་གླིང་གི་དབུས་སུ། རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་ཞེས་བྱ་བ། གྲོང་རྡལ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་ཕུལ་དུ་བྱ་བ་བྱུང་བ་སྟེ།
en: In the center of the Jambudvīpa of that four-continent world there was the royal capital called Druma­meru­śrī, the principal city from among eighty-four thousand cities.

source: རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེ་དང་། གྲོང་རྡལ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་ཀྱང་སོ་སོ་ནས་སའི་གཞི་བཻཌཱུརྱ་སྔོན་པོ་ལས་གྲུབ་པ་ལ་གནས་པ།
en: In the royal capital Druma­meru­śrī and each of the eighty-four thousand towns, the ground was made of blue beryl.

source: རིན་པོ་ཆེ་བདུན་ལས་བྱས་པའི་ར་བས་ཀུན་ནས་བསྐོར་བ།
en: Walls made of the seven precious materials encircled them.

source: འོབས་སྤོས་ཆུས་ཡོངས་སུ་གང་བ་གཞི་གསེར་གྱི་བྱེ་མ་བདལ་བ། ཨུཏྤལ་དང་། པདྨོ་དང་། ཀུ་མུ་ཏ་དང་། མེ་ཏོག་པུནྡ་རི་ཀ་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་ཁ་དོག་དང་འོད་ཀྱི་དྲ་བ་སྣ་ཚོགས་ཤིང་དྲི་ཤིན་ཏུ་ཞིམ་པས་ཀུན་ནས་ཁྱབ་པ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ།
en: And they were each encircled by seven moats that were filled with scented water and had bottoms covered in gold dust and surfaces covered with blue lotuses, red lotuses, night lotuses, and white lotuses that were the size of wagon wheels, shone with light rays of various colors, and had all-pervading lovely aromas.

source: རིན་པོ་ཆེ་ལས་བྱས་པའི་སྟེགས་བུའི་ཁྲི་འཕང་བདུན་ལས་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་དགྲིགས་པ།
en: There were rows of seven promenades made of the seven precious materials and seven rows of palm trees.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་གི་ནགས་ཚལ་གྱི་ཕྲེང་བ་དགྲིགས་པས་ཀུན་ནས་བསྐོར་བ་སྟེ།
en: They were encircled by seven successive planted forests of trees made of the seven precious materials.

source: སྟེང་ནས་གསེར་གྱི་དྲ་བ་བྲེས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་ཕྱེ་བའི་མིག་མངས་རིས་མཛེས་པར་རྣམ་པར་བྲེས་པས་སའི་གཞི་ཤིན་ཏུ་སྤ་བར་གྱུར་བ། དངོས་གྲུབ་ཅན་གྱི་ཚོགས་རྣམ་པར་རྒྱུ་བ།
en: Above there was a canopy of a net of gold. The ground was beautifully adorned by various jewels arranged in checkerboard patterns. Groups of siddhas wandered around.

source: བྱ་བཙུན་པའི་ཁྱུས་སྒྲ་སྐད་ཡིད་དུ་འོང་བའི་དབྱངས་སྙན་པ་ཕྱུང་བ།
en: From flocks of noble birds came the beautiful sound of their melodious songs.

source: བཟའ་ཤིང་གི་ར་བ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གིས་མཛེས་པར་བྱས་པ་ཤིན་ཏུ་སྐྱིད་ཅིང་ཕུན་སུམ་ཚོགས་པར་གནས་པ་སྐྱེས་པ་དང་། བུད་མྱེད་བརྒྱ་སྟོང་རབ་ཏུ་དགའ་བས་གང་བ།
en: The towns were beautified by a trillion parks. They had abundant good fortune, and they were filled with crowds of hundreds of thousands of joyful men and women.

source: སེར་བུ་བདེ་ཞིང་ཡིད་དུ་འོང་བས་བསྐྱེད་དེ། མེ་ཏོག་གི་ཆར་མང་པོ་རྒྱུན་མི་འཆད་པར་རབ་ཏུ་འགྲུལ་བ།
en: Pleasant, delightful breezes blew, and rains of many flowers continuously fell.

source: སའི་བདག་པོ་དམ་པ་བརྒྱ་ཕྲག་སྟོང་གི་གནས་སུ་གྱུར་པ་དག་སྟེ།
en: A hundred thousand kings dwelled among them.

source: གྲོང་རྡལ་ཆེན་པོ་དེ་དག་གི་རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་དང་། གསེར་གྱི་དྲ་བའི་རྒྱན་ལ་སྩོགས་པ་རླུང་གིས་བསྐྱོད་དེ། རོལ་མོ་མང་པོའི་སྒྲ་དང་མཉམ་པའི་སྒྲ་སྐད་བྱུང་བ་དག་ལས་ཡིད་དུ་འོང་བའི་ཚིག་འདི་སྐད་དག་འབྱུང་ངོ་།
en: When all the precious trees, adornments of gold, and so on in the great towns were moved by the wind, there came from them the many sounds of music, and harmonious voices arose saying these happy words:

source: །གསོལ་ཅིག་མནོབས་ཤིག་ཆོས་ལ་སྤྱོད་ཅིག །བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །ཕྱིར་མྱི་ལྡོག་པའི་ས་ལ་མངའ་ཐོབ་པར་མཛོད་ཅིག །ཁྱེད་རྣམས་བདེ་བར་གྱུར་ཅིག་ཅེས་ཟེར་རོ།
en: ‘Bathe! Practice the Dharma! Develop the aspiration for enlightenment! Attain the power of the level of irreversibility! Be happy!’

source: །རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེར་ཁམས་ཀྱི་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “In the royal city of Druma­meru­śrī there was the king of the realm whose name was Dhanapati.

source: དེ་ལ་བཙུན་མོའི་འཁོར་བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོད་དོ། །བློན་པོ་བརྒྱ་ཕྲག་ལྔ་ཡོད་པར་གྱུར་ཏེ།
en: He had a harem of eighty-four thousand queens and five hundred ministers.

source: རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་དེ་ལ་བུ་ལྔ་བརྒྱ་ཡོད་པ་དེ་ཐམས་ཅད་ཀྱང་། དཔའ་བོ་རྟུལ་ཕོད་པ་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ། གཞན་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་ཤིན་ཏུ་མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: King Dhanapati had five hundred sons, and they were all courageous and heroic, with perfect bodies, victorious over opponents, handsome, attractive, and with a magnificent, supreme, beautiful color.

source: ཁ་དོག་བཟང་པོའི་མཆོག་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པ་ཤ་སྟག་གོ །རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་དེའི་བཙུན་མོ་དམ་པ་ནི་པདྨོའི་དཔལ་དམ་པ་འབྱུང་བ་ཞེས་བྱ་བ་སྟེ། བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་གི་ནང་ནས་གཙོ་མོར་བྱ་བའོ།
en: “King Dhanapati’s principal queen was Padma­śrī­garbha­saṃbhavā, who was the foremost among the eighty-four thousand wives.

source: །དེའི་བུ་གཟི་བརྗིད་ཀྱི་དབང་པོ་ཞེས་བྱ་བ་གཟུགས་བཟང་བ་ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ།
en: Her son was Tejodhipati. He had an excellent body and was handsome and attractive.

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་ལུས་དང་ལྡན་པ་ཞིག་ཡོད་པར་གྱུར་ཏེ།
en: He was beautified by the thirty-two physical signs of a great being in the following way:

source: །དེའང་འདི་ལྟར་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དེ་རྐང་པའི་མཐིལ་ཤིན་ཏུ་གནས་པ་དང་ལྡན་ཏེ།
en: “The soles of Prince Tejodhipati’s feet were well placed. When he took steps on the great earth, he stepped evenly.

source: ས་ཆེན་པོ་ལ་རྐང་པའི་མཐིལ་འདོར་ན་མཉམ་པར་འདོར་ལ། འདེག་ན་མཉམ་པར་འདེག་སྟེ།
en: When he raised a foot, it was raised evenly, and when he placed his foot down, the entire sole of the foot touched the great earth evenly.

source: གཞོག་ན་རྐང་པའི་མཐིལ་ཀུན་གྱིས་ས་ཆེན་པོ་ལ་མཉམ་པར་རེག་གོ །དེའི་རྐང་པའི་མཐིལ་གཉིས་ལ་འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ། ལྟེ་བ་དང་བཅས་པ་མུ་ཁྱུད་དང་བཅས་པ། རྣམ་པ་ཐམས་ཅད་དུ་ཤིན་ཏུ་ཚང་བ་ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ་དག་ཀྱང་བྱུང་བར་གྱུར་ཏོ།
en: “On the soles of his feet and the palms of his hands there was a thousand-spoked wheel, with hubs and rims, complete in all aspects, beautiful, and attractive.

source: །དེའི་རྐང་པའི་བོ་ལ་གཉིས་ཀྱང་ཤིན་ཏུ་རྒྱས་པར་གྱུར་ཏོ།
en: “The upper part of both his feet was very prominent:

source: །རྐང་པའི་སྟེང་གི་མདོག་ཤིན་ཏུ་གསལ་ལ། ཤིན་ཏུ་མཛེས་ཏེ། མེ་ཏོག་དམ་པ་བས་ཀྱང་ལྷག་པར་མདོག་བཟང་ཞིང་གསལ་བར་གྱུར་ཏེ།
en: the upper surface of his feet had a clear and very beautiful color, a color better and brighter than excellent flowers.

source: དེའི་རྐང་ལག་གི་སོར་མོ་དྲ་བར་འབྲེལ་པར་གྱུར་ཏེ།
en: “His toes and fingers were connected by a web:

source: ཤིན་ཏུ་མཛེས་པ་རྣམ་པར་ཕྱེ་བ། བུ་ག་མེད་པས་ཟག་པ་མེད་པ་ནི་དཔེར་ན་ངང་པའི་རྒྱལ་པོ་གནས་སྲུང་ལྟ་བུར་གྱུར་ཏོ།
en: they were very beautiful, distinct, and with no holes or suppurations, like those of Dhṛtarāṣṭra, the king of geese.

source: །དེའི་རྐང་པའི་རྟིང་པ་ཡངས་པ་ཤིན་ཏུ་དག་ལ་ཤིན་ཏུ་གསལ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་རབ་ཏུ་འགྱེད་པར་གྲུབ་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: His heels were wide: they were pure, bright, and shining with the lights of all jewels.

source: །དེའི་སོར་མོ་རྣམས་ཀྱང་རིང་ཞིང་ཟླུམ་ལ་ཚིགས་བར་མཉམ་ཞིང་ཡངས་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: His toes and fingers were long:

source: དེ་དག་མཉམ་པར་ས་ལ་འཇོག་གོ །མཉམ་པར་ས་ལས་འདེག་གོ །དེའི་རྐང་པ་དང་ལག་པའི་མཐིལ་ཡང་ཀ་ཙ་ལིནྡི་བས་ཀྱང་ལྷག་པར་རེག་ན་བདེ་བར་གྱུར་ཏེ།
en: they were rounded, with evenly spaced joints and wide, and the toes came down evenly onto the ground and lifted off evenly from the ground. 7. The soles of his feet and the palms of his hands were more pleasant to the touch than down.

source: དེས་སྐྱེས་པ་འམ་བུད་མེད་དམ། ཁྱེའུ་དང་བུ་མོ་གང་ལ་རེག་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་བདེ་བ་དང་། ཡིད་དགའ་བའི་དམ་པས་ཚིམ་ཞིང་ཡིད་ཤིན་ཏུ་བདེ་བར་འགྱུར་རོ།
en: Whether it was a man or a woman, a boy or a girl who touched them, they were delighted and were made content and happy by perfect bliss.

source: རིམ་གྱིས་གཞོལ་བ་དང་། ཤིན་ཏུ་མཛེས་པ་དང་། ལེགས་པར་གྲུབ་པར་གྱུར་པས།
en: “His calves were like those of the female blackbuck, gradually tapering, very beautiful and well formed.

source: རི་དགས་ཀྱི་རྒྱལ་པོ་ཨེ་ནེ་ཡ་ལྟར་དེ་ལ་སུས་ཀྱང་བསྙེགས་པ་འམ། སླེབས་པར་མི་ནུས་ཏེ། འགྲོ་བས་ངལ་ཞིང་དུབ་པར་མི་འགྱུར་རོ།
en: Like the female blackbuck, monarch among deer, no one could run after him and catch him, and he never became tired and fatigued when running.

source: །རྒྱལ་བུ་གཞོན་ནུ་གཟི་བཇིད་ཀྱི་དབང་པོ་དེ་བདུན་ཤིན་ཏུ་མཐོ་བ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “The young prince Tejodhipati had the seven prominences.

source: དེའི་རྐང་པ་གཉིས་ལ་ཤིན་ཏུ་མཐོ་བ་ཟླུམ་ལ་ཤིན་ཏུ་ལེགས་པ་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཚིགས་མི་སྣང་བ་དང་། ཤིན་ཏུ་ཡིད་དུ་འོང་བ་དང་། བལྟ་ན་སྡུག་པ་གཉིས་གྲུབ་པར་གྱུར་ཏོ། །ལག་པ་ལ་གཉིས། ཐལ་གོང་གི་ལྷུན་ལ་གཉིས། ལྟག་པ་ལ་གཅིག་སྟེ། དེ་ལྟར་བདུན་ནོ།
en: These seven were his two feet, which were prominent, rounded, excellent, wide, with joints not visible, beautiful, and attractive, and similarly his two hands, his two shoulders, and the nape of his neck.

source: །དེའི་མཚན་གསང་བའི་སྦུབས་ན་འདུག་པར་གྲུབ་པར་གྱུར་ཏེ།
en: “His penis was retracted into his body:

source: དེའི་གསང་བའི་གནས་སྦུབས་ན་འདུག་པ་ཤིན་ཏུ་མི་མངོན་ལ་ནང་དུ་ནུབ་ཅིང་ཀུན་ནས་ཡོག་པར་འདུག་པ་སྟེ། དཔེར་ན་གླང་པོ་ཅང་ཤེས་སམ། རྟ་ཅང་ཤེས་ལྟར་འདུག་པས་དེ་གོས་མ་གྱོན་པར་འདུག་ཀྱང་བུད་མེད་དམ། སྐྱེས་པ་འམ། ཁྱེའུ་འམ།
en: As his penis was retracted into his body, it was not visible but completely hidden and obscured, like that of an elephant or a stallion.

source: བུ་མོ་འམ། རྒན་པ་འམ། དར་ལ་བབ་པ་འམ། བླ་མ་འམ། བླ་མར་བྱ་བ་རྣམས་ཀྱིས་ཀྱང་མི་མཐོང་སྟེ། གཞན་དུ་ན་བདག་ལོངས་པར་སྤྱོད་པ་འམ།
en: Therefore, it was unstained and could not be seen by a woman or a man, a boy or a girl, someone who was old, middle-aged, or young, or a guru or a guru’s disciple, unless he was using it or wished to show it or was having sexual intercourse.

source: །རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དེ་རོ་སྟོད་སེང་གེ་ལྟར་འདུག་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “The young prince Tejodhipati’s torso was like that of a lion:

source: ལུས་རིམ་པས་རྒྱས་ལ་རོ་སྟོད་ཤིན་ཏུ་ཡངས་ཤིང་རྫོགས་པས་རི་དགས་ཀྱི་རྒྱལ་པོ་བས་ཀྱང་མཛེས་པར་དབྱིབས་ཤིན་ཏུ་ལེགས་པའི་རོ་སྟོད་དང་ལྡན་པར་གྱུར་ཏོ། །དེའི་ཐལ་གོང་རྒྱས་ཤིང་ལུས་ཤིན་ཏུ་རྒྱས་པ་ལུས་རྣམ་པར་ཕྱེ་བ།
en: his body gradually widened so that his torso was broad and perfect, more beautiful and excellently shaped than that of the king of the animals.

source: ལུས་ཀྱི་ཆ་ཐམས་ཅད་རྐྱེན་དུ་འབབ་པར་མཉམ་པ།
en: “He had wide shoulders:

source: ལུས་ལ་དམའ་བ་མེད་པ། ལུས་ལ་མཐོ་བ་མེད་པ། ལུས་ལ་ཞུམ་པ་མེད་པ། ལུས་ལ་དགུ་བ་མེད་པ། ལུས་རིན་པོ་ཆེའི་གཏན་པ་ཤིན་ཏུ་ཕྱིས་པ་བས་ཀྱང་ལྷག་པར་གསལ་བར་གྱུར་ཏོ།
en: he had a very broad body, a perfectly proportional body, a perfectly symmetrical body, a body that was not too bulky, a body that was not too thin, a body that was not feeble, a body that was not stooped, and a body that shone brighter than a polished slab of jewels.

source: །དེའི་དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་ཞིང་ཤ་རྒྱས་ལ་ཤིན་ཏུ་མཛེས་པར་གང་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: “He had large shoulders: his shoulders were muscular, and his arms beautifully filled out.

source: །དེས་མི་ཆེན་པོའི་མཚན་ལག་པ་ཤིན་ཏུ་རིང་བ་ཐོབ་པར་གྱུར་པ་དེས་ལུས་མ་བཏུད་དེ།
en: “He had also attained the sign of a great being of his arms being very long:

source: ལུས་དྲང་པོར་འདུག་ཀྱང་པུས་མོའི་ལྷ་ང་གཉིས་ལ་ཉུག་ཅིང་རེག་གོ །དེས་མི་ཆེན་པོའི་མཚན་ལུས་ཆེ་ཞིང་དྲང་བའང་ཐོབ་པར་གྱུར་ཏེ།
en: even without bending, while standing up straight, his hands could touch and rub his kneecaps. 15. “He had also attained the sign of a great being of his body being tall and straight.

source: རྣམ་པ་ཐམས་ཅད་དུ་མཆོག་ཏུ་གྱུར་པ་དང་ལྡན་ལ་ལུས་ཚུལ་དང་འདྲ་བར་མཉམ་པ་དང་། ལུས་རབ་ཏུ་གཉེན་པ་དང་། ལུས་ཤིན་ཏུ་ལྗི་བ་དང་། ལུས་རབ་ཏུ་གསལ་བ་དང་། ལུས་ཤིན་ཏུ་སིམ་པར་བྱེད་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: It was perfect in all its aspects and was properly formed. His body was supple. His body was very heavy. His body was very bright. His body was very pleasing to the eyes.

source: །དེས་མི་ཆེན་པོའི་མཚན་མགུལ་དུང་ལྟ་བུ་ཡང་ཐོབ་པར་གྱུར་ཏེ།
en: “He had also attained the sign of a great being’s conch-like throat. His neck was not short.

source: མི་དམའ་བའི་མགུལ་དང་། དེའི་མགུལ་གྱི་འཁོར་ཐམས་ཅད་དང་། བཞིན་གྱི་འཁོར་ཐམས་ཅད་ན་རྩ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་མཉམ་པར་གྱུར་ཏེ།
en: All the channels of taste in the area of the throat and the area of the mouth were balanced and complete.

source: །མི་ཆེན་པོའི་མཚན་སེང་གེའི་འགྲམ་པ་ལྟ་བུ་ཡང་ཐོབ་པར་གྱུར་ཏེ།
en: “He had also attained the sign of a great being’s lion-like cheeks and jaws.

source: ཟ་འགྲམ་ཤིན་ཏུ་འཁྲེགས་པ་དང་། བཞིན་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་རྒྱས་པ་དང་། བཞིན་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ལེགས་ཤིང་ཡོངས་སུ་དག་པ་དང་། ཁའི་སྒོ་ཤིན་ཏུ་ཡངས་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: His jaws were very firm. His face was very wide, his face was excellent and pure, and his mouth was wide.

source: །མི་ཆེན་པོའི་མཚན་སོ་མཉམ་པ་བཞི་བཅུ་དང་ཡང་ལྡན་པར་གྱུར་ཏེ།
en: “He also possessed the sign of a great being’s forty even teeth.

source: སོ་མ་ཚང་བ་མེད་ལ་ཟས་ཤིག་ཟས་ཡང་ལན་གཅིག་བལྡད་པས་ཆུང་ངུ་ན་འབྲས་ཆན་གྱི་འབྲུ་འགའ་ཡང་མ་ཞིབ་པར་ཟ་བ་མེད་དོ།
en: There were no missing teeth. When he ate food, with one chew there was no food that remained unmasticated, not even a single grain of rice.

source: །སོ་ཐགས་བཟང་ཞིང་མཉམ་པར་རབ་ཏུ་ཐོབ་སྟེ།
en: “He had attained even, gapless rows of teeth:

source: མཚམས་ཆུ་སྒོ་མེད་པ་དང་། ཤིན་ཏུ་མཉམ་པ་དང་། རྐྱེན་རྐྱེན་ཏུ་ཤིན་ཏུ་མཛེས་པ་སྟེ།
en: there were no gaps, and they remained perfectly even and constantly beautiful, whatever occurred.

source: དེ་ཁ་ཟས་ཤིག་ཟ་ན་ཡང་འགོ་བ་དང་། འཆགས་པ་དང་། ཞེན་པ་དང་། ལྗན་ལྗིན་ཏུ་འགྱུར་བའམ།
en: The food he ate would not discolor his teeth, stick to his teeth, adhere to his teeth, cause his teeth to rot, cause abscesses, or get stuck between his teeth.

source: །མི་ཆེན་པོའི་མཚན་སོ་མཉམ་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: “He had also attained the great being’s sign of even teeth:

source: སོ་མཉམ་ཞིང་རྡ་རྡོ་མེད་པ་དང་། སོ་ལྷག་མེད་པ་དང་། སོ་ཞུམ་པ་མེད་པ་དང་། སོ་གྱེས་པ་མེད་པ་དང་སོ་ཐོག་དྲུང་མཉམ་པ་དང་། སོ་རྡོ་བ་མེད་པར་གྱུར་ཏོ།
en: his teeth were even and not irregular, there was no deficiency in teeth, no extra teeth, no taller teeth, no smaller teeth, and no compacted teeth; the teeth were equal in height and breadth, and there were no broken teeth.

source: །གཞོན་ནུ་དེའི་མཆེ་བ་ཤིན་ཏུ་དཀར་བར་གྱུར་ཏེ།
en: “The youth’s eyeteeth were very white:

source: མཆེ་བ་ཤིན་ཏུ་གསལ་བ། མཆེ་བ་ཤིན་ཏུ་དག་པ། མཆེ་བ་ཤིན་ཏུ་བརྟན་པར་གྱུར་ཏོ།
en: his eyeteeth were without defects, his eyeteeth were bright, his eyeteeth were pure, and his eyeteeth were strong.

source: །མི་ཆེན་པོའི་མཚན་ལྕེ་ཤིན་ཏུ་ཡངས་པ་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: “He had also attained the great being’s sign of a wide tongue:

source: དེའི་ལྕེ་ནི་ཤིན་ཏུ་ཡངས་ལ་སྲབ་ཅིང་མཉེན་ཏེ། ཤིན་ཏུ་འཇམ་པ་དང་། ལས་སུ་རུང་བ་དང་། ཡིད་དུ་འོང་བ་དང་བསྒྱུར་ན་བདེ་བ་དང་། གདོང་གི་དཀྱིལ་འཁོར་ཀུན་ཏུ་འགེབས་པ་དང་། བདེན་ཞིང་ཕན་པར་འགྱུར་བའི་དོན་དང་། ཡི་གེ་དང་ངག་དང་ངེས་པའི་ཚིག་ཐོགས་པ་མེད་པར་བརྗོད་པར་གྱུར་ཏོ།
en: his tongue was wide, fine, very smooth, flexible, beautiful, versatile, could cover his entire face, and spoke without impediment true and beneficial meanings, consonants, words, and definitions.

source: །གཞོན་ནུ་དེ་ཚངས་པའི་དབྱངས་དང་ལྡན་པར་གྱུར་ཏེ།
en: “The prince had the voice of Brahmā:

source: དབྱངས་ཡིད་དུ་འོང་བ་དང་། རོལ་མོའི་སྒྲ་དང་། གླུའི་ང་རོ་དང་། སིལ་སྙན་ཀྱི་དབྱངས་དང་། སྒྲ་སྐད་དང་བརྗོད་ཅིང་སྨྲ་བའི་ཚིག་གི་ལས་ཡིད་དུ་འོང་བ་བརྗོད་པས་ངག་གི་ལས་མངོན་པར་དགའ་བ་སྐྱེད་པ།
en: he had a beautiful voice that spoke with an activity of speech that had all the beautiful sounds of drumming, songs, musical instruments, speech, and conversation, which brought joy and inspired the world.

source: འཇིག་རྟེན་ཐམས་ཅད་མངོན་པར་འདུན་པར་འགྱུར་བར་ཚངས་པ་ལས་ཀྱང་ལྷག་པའི་དབྱངས་ཀྱི་ངག་རྗོད་དེ། འཁོར་གྱི་དཀྱིལ་འཁོར་ལས་ཀྱང་གུད་དུ། མི་འདའ་བར་ཐམས་ཅད་ཀྱི་ཡིད་དང་། མཐུན་པར་བྱེད་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: He had a voice that was superior even to Brahmā’s, yet it was not beyond and inaccessible to his circle of followers but harmonized with everyone’s minds.

source: མིག་དཀར་ནག་འབྱེས་པར་གྱུར་ཏེ།
en: “The prince had distinctly deep black eyes:

source: མིག་ཤིན་ཏུ་དང་བ་དང་། མིག་ཡོངས་སུ་དག་པ་དང་། མིག་ལ་འོད་ཆགས་པ་དང་། མིག་རྣམ་པར་གསལ་བ་དང་། མིག་མངོན་པར་མཛེས་པ་དང་། མིག་བལྟ་ན་སྡུག་པ་དང་། མིག་ཡིད་དུ་འོང་བ་དང་། མིག་འཛུམ་པ་དང་ལྡན་པར་གྱུར་ཏོ། །གཞོན་ནུ་དེ་ནི་རྫི་མ་བའི་རྫི་མ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏེ།
en: he had clear eyes, pure eyes, bright eyes, serene eyes, beautiful eyes, delightful eyes, attractive eyes, and smiling eyes.

source: མིག་གི་སྐྱེ་མཆེད་རིན་པོ་ཆེ་པདྨ་རཱ་ག་ལྟར་ཤིན་ཏུ་དག་པ།
en: “The prince had eyelashes like a cow’s eyelashes:

source: མིག་གི་སྤྲིན་མཉམ་པ། མིག་གི་སྤྲིན་མཚུངས་པ། མིག་གི་སྤྲིན་ལེགས་པ། མིག་གི་སྤྲིན་ཡངས་པ། མིག་གི་སྤྲིན་ཤིན་ཏུ་བརྟན་པར་གྱུར་ཏོ། །དེའི་སྨིན་མཚམས་སུ་མཛོད་སྤུ་སྐྱེས་པར་གྱུར་ཏེ།
en: he had sensory faculties of the eyes that were like pure ruby jewels, sameness of the whites of the eyes, identical whites of the eyes, excellent whites of the eyes, wide whites of the eyes, complete whites of the eyes, and constant whites of the eyes.

source: ཤིན་ཏུ་མཉེན་པ།
en: “In between his eyebrows an ūrṇā hair had grown:

source: ཤིང་བལ་ལྟར་རེག་ན་བདེ་བ། དང་བ། གསལ་བ་འོད་ཡོད་པ། ཆབ་བྲོམ་ལྟ་བུ་ཁ་བའི་ཁ་དོག་ལྟར་འདུག་པ། འོད་ཟེར་དཀར་པོའི་དཀྱིལ་འཁོར་གྱི་འོད་རབ་ཏུ་སྣང་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: it was soft and pliable, delicate, as pleasant to the touch as cotton wool, clear, bright, the color of snow, and like ice, and it had the shining light of a halo of white light rays.

source: །དེའི་སྤྱི་བོ་ལ་གཙུག་ཏོར་མངོན་པར་གྲུབ་པར་གྱུར་ཏེ།
en: “There was an uṣṇīṣa formed on the crown of his head:

source: ཤིན་ཏུ་ལེགས་པ། ཀུན་ནས་ཟླུམ་པ། དབུས་སུ་བབ་པ། སྐྲའི་རྒྱན་དུ་གྱུར་པ། རིན་པོ་ཆེའི་པད་མོ་འདབ་མ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་ལྡན་པ་ལྟར་སྣང་བ།
en: it was well formed, perfectly round, central, an adornment of the hair, resembling a precious lotus with a trillion petals, perfectly symmetrical, and cherished as a priceless crest adornment.

source: །གཞོན་ནུ་དེ་ནི་པགས་པ་ཤིན་ཏུ་འཇམ་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “The prince had very smooth skin:

source: དེའི་ལུས་ལ་རྡུལ་ལམ། དྲི་མའམ། རྔུལ་ལམ། སེར་གའམ། གཉེར་མའམ། ལྷོད་པའམ། འཁུམས་པའམ།
en: his body was free of dust, stains, sweat, cracks, wrinkles, flabbiness, shriveling, sagging, and looseness.

source: །གཞོན་ནུ་དེ་ནི་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “The prince was golden in color:

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་མདོག་ལྟ་བུ་དང་ལྡན་ཞིང་འོད་ཀུན་ཏུ་འདོམ་གང་བ་དང་། གསེར་ལྟར་གཅིག་ཏུ་འབར་བའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱིས་མཛེས་པར་བརྒྱན་པ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་དྲི་ཞིམ་པོའི་འོད་ཟེར་འབྱུང་བས་ལུས་ཀྱི་རྒྱན་རབ་རིབ་མེད་ཅིང་འོད་གསལ་བ་དང་ལྡན་པར་གྱུར་ཏོ། །གཞོན་ནུ་དེ་ནི་བ་སྤུ་རེ་རེར་བྱུང་བ་དང་ལྡན་པར་གྱུར་ཏེ།
en: he was the color of Jambu River gold, had a halo a fathom wide, and was beautifully adorned by a halo of light that shone like gold. 30. “That youth had arising from each pore a darkness-dispelling brightness of aromatic light rays that arose from all his pores and adorned his body:

source: བ་སྤུའི་བུ་ག་རེ་རེ་ནས་བ་སྤུ་རེ་རེ་སྐྱེས་པར་གྱུར་པ། བཻཌཱུཪྻ་སྔོན་པོའི་ཁ་དོག་ལྟ་བུ་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ། ལེགས་པར་སྐྱེས་པ། མཐང་ལ་ཞ་བར་འདུག་པ་ཤིན་ཏུ་ལེགས་པར་གནས་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: from each pore grew perfectly a body hair that was the color of blue beryl and curled to the right, peacefully present on the body, perfectly arranged, perfectly present, perfectly established.

source: །གཞོན་ནུ་དེའི་སྤུ་ཡན་ལག་གྱེན་དུ་འཁྱིལ་པར་གྱུར་ཏེ།
en: The youth’s body hairs curled upward;

source: ཕྱིར་མི་ཟློག་པའི་སྤུ་དང་། མི་ལྡོག་པའི་སྤུ་དང་། མ་འདྲེས་པའི་སྤུ་དང་ལྡན་པར་གྱུར་ཏོ།
en: his body hairs did not turn downward, his body hairs were irreversible, and his body hairs were unmixed.

source: །གཞོན་ནུ་དེ་མི་ཆེན་པོའི་མཚན་སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ་ཐོབ་པར་གྱུར་ཏེ། དེའི་སྐྲ་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་མདོག་ལྟར་མཐོན་ཏིང་དུ་འདུག་པ།
en: “The youth had attained the great being’s sign of having hair the color of blue sapphire: his hair was deep blue like the color of a shining blue precious jewel.

source: འཇམ་པ་སྣུམ་པ། ལེགས་པར་འཁྱིལ་པ། གཡས་ཕྱོགས་སུ་འཁྱིལ་བ། དྲུང་ཤིན་ཏུ་རན་པ།
en: It was soft, shiny, perfectly curving, curling to the right, and with good roots;

source: ཟད་ཟེད་མེད་པ། འཇམ་འཇམ་ལྟར་འདུག་པ། མི་འཛིང་བ། དབྱིབས་མཉམ་ཞིང་མཐུན་པར་གནས་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: it did not stand up, never tangled, was never in disarray, and always remained with the same even appearance.

source: །རྒྱལ་བུ་གཞོན་ནུ་དེ་ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པའི་མི་ཆེན་པོའི་མཚན་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: “The young prince had attained the great being’s sign of being like the overspreading width of a banyan tree:

source: ཀུན་ནས་གྱེན་དུ་རན་པ་དང་། ཀུན་ཏུ་བཟང་བ་དང་། ཀུན་ཏུ་མཛེས་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: he was perfectly upright, completely good, and utterly beautiful.

source: དེ་ནི་མདུན་ནས་བལྟས་ནའང་ངོམས་མི་ཤེས་ཤིང་བལྟ་ན་ཡིད་དུ་འོང་བ་རྒྱབ་དང་གཡས་གཡོན་དང་། འགྲོ་བ་དང་འདུག་པ་དང་། འགྲེང་བ་དང་ཉལ་བ་དང་། སྨྲ་བ་དང་། མི་སྨྲ་བར་འདུག་པ་ལ་བལྟས་ན།
en: He was a lovely sight, and one could never have enough of gazing upon him. Whether from the back, the left, or the right; whether he was walking, sitting, standing, or lying down;

source: ཡང་ངོམས་མི་ཤེས་ཤིང་ཡིད་དུ་འོང་ལ་བལྟ་ན་སྡུག་པར་གྱུར་ཏོ།
en: whether he was talking or silent, he was a lovely sight, and one could never have enough of gazing upon him.

source: །རིགས་ཀྱི་བུ་རྒྱལ་པོ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དེ་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས་ཡོངས་སུ་བརྒྱན་པའི་ལུས་དང་ལྡན་པར་གྱུར་ཏེ།
en: “Noble one, Prince Tejodhipati had a body completely adorned by these thirty-two signs of a great being.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བལྟ་ན་ཡིད་དུ་མི་འོང་བའི་བག་མེད་པ་བལྟ་ན་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ། བལྟ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བ་ཡོངས་སུ་འབྱུང་བ།
en: “Noble one, he was a sight that was comforting to all beings, he was a sight that fulfilled all intentions, and he was a sight that brought delight to all beings.

source: དེ་ལྟ་བུ་ཞིག་སྐྱེས་པར་གྱུར་ཏོ།
en: This was how he had been born.

source: །རིགས་ཀྱི་བུ་དེ་ནས་ལན་གཅིག་ཅིག་རྒྱལ་པོ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དེ་ཡབ་ཀྱིས་གནང་ནས་རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོ་དཔལ་གྱི་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ལས་འོད་ཀྱི་སྤྲིན་འབྱུང་བ་ཞེས་བྱ་བ་དེར་ས་བཟང་པོ་ལྟ་བའི་ཕྱིར་བུ་མོ་སྟོང་ཕྲག་ཉི་ཤུ་དང་ལྷན་ཅིག་ཏུ་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་དང་དཔལ་གྱི་བསྐལ་པ་བཟང་པོའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་གྱིས་བྱུང་ནས་སྐྱེས་པ་དང་། བུད་མྱེད་ཀྱི་ཚོགས་ཀྱིས་ཀུན་ནས་དགའ་བར་བྱ་ཞིང་།
en: “Noble one, at one time, Prince Tejodhipati, having obtained permission from his father, was going, accompanied by twenty thousand maidens, to the park of the royal capital of Druma­meru­śrī, which was called Gandhāṅkura­prabha­megha, in order to see that good place. He delighted a crowd of men and women with the display of the miraculous manifestations from the splendor of his merit and his glorious good fortune.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཤིང་རྟ་རྡོ་རྗེ་རིན་པོ་ཆེའི་འཁོར་ལོ་ཆེན་པོ་བཞི་དང་ལྡན་པ།
en: “He mounted a chariot made of Jambu River gold. It had four great wheels of precious diamonds.

source: རྡོ་རྗེ་མཐུ་བོ་ཆེའི་སྲོག་ཤིང་གི་རྩ་བ་ཅན་ཙན་དན་དམ་པ་ལས་བསྒྲུབས་པའི་ཡུལ་བཟང་པོ་དང་ལྡན་པ།
en: It had an axle that was a powerful vajra. Its excellent shafts were made from the best sandalwood.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་སྣ་ཚོགས་ཀྱི་ཤིང་ཐགས་རྣམ་པར་བཀྱེ་བ།
en: It had well-arranged poles made of a variety of perfumed kings of jewels.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་མཛེས་པར་བྱས་པ།
en: It was decorated by a variety of flowers made from all jewels.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བས་ཀུན་ནས་ཡོག་པའི་རྒྱན་དང་ལྡན་པ།
en: It was covered by nets of strings of all jewels.

source: སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་དམ་པའི་དྲ་བའི་རྒྱན་གྱི་སྙིང་པོ་ཅན་དབུས་སུ་བཤམས་པ།
en: In its center was a precious lion throne on which was a display of a network of sublime jewels.

source: བུ་མོ་ལྔ་བརྒྱས་རིན་པོ་ཆེའི་སྲད་བུའི་ལྡ་ལྡི་ནས་ཡོངས་སུ་གཟུང་བ།
en: Five hundred maidens held its tasseled cords.

source: ནམ་མཁའ་ལ་ཆགས་པ་མེད་པའི་རླུང་ལྟར་མགྱོགས་པའི་རྟ་ཅང་ཤེས་སྟོང་དང་བཅས་པ་ལ་ཞོན་ནས་གདུགས་ཆེན་པོ་རིམ་གྱིས་གཞོལ་ཞིང་བལྟ་ན་སྡུག་པ།
en: Yoked to the carriage were a thousand thoroughbred stallions that could run as fast as the wind moves freely through the air.

source: སྟེང་ཡོངས་རིན་པོ་ཆེའི་རྒྱལ་པོའི་བཻཌཱུཪྻ་དཀར་པོ་ལས་བྱས་པ།
en: It had a succession of beautiful great parasols. It had an awning made from white beryl kings of jewels.

source: འོད་དྲི་མ་མྱེད་པ་ཚད་མེད་པ་འབྱུང་བ།
en: It shone with pure immeasurable light.
